{
    "basic_info": {
      "description_header": "Hi",
      "description": {
        "one": "As an experienced Software Developer with a focus on JavaScript React, Python, Django, and Node.js, I am currently seeking new opportunities in Junior Dev/Engineering roles, as well as entry-level positions and internships. With two years of industry experience under my belt, I have honed my skills in developing high-quality software solutions that meet the needs of clients and end-users alike.",
        "two":"Coming from a Somali household, I have always placed a strong emphasis on family values, and this has been reflected in my approach to my work. I have lived in a number of different locations across the United States, including Seattle, WA, and Columbus, OH, spending around seven years in each city. This has given me a broad perspective on different cultures and ways of working, and I am always eager to learn and grow both personally and professionally.",
        "three":"I am an open and personable individual who is always willing to connect with others in the industry. If you have any opportunities that you think might be a good fit for my skills and experience, please don'\tt hesitate to reach out. I would be honored to explore any potential blessings that may come my way.",
        "four":"Writing code always seemed like a chore to me but that's only because I never applied/understood what It meant to Problem solve. Problem solving is what pushed the web to where its at now. Being able to produce a clean and concise piece of code that does exactly what you intend is nothing short of satisfying; however, being able to tackle a problem and solve it...now that's the real reward."
      },
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "MadLibs",
        "startDate": "2022",
        "description": "webpage that takes user inputs from a series of prompts that generates a creative story from that input. This will solve the users boredom by engaging their brain in a nice story driven rpg. The user will get inspiration from exercising their creativity.",
        "images": [
          "images/portfolio/animal-shelter/madlibs(landing).webp",
          "images/portfolio/animal-shelter/main page final project.png",
          "images/portfolio/animal-shelter/madlibs(adventurestory).webp",
          "images/portfolio/animal-shelter/madlibs(sci-fi).jpg",
          "images/portfolio/animal-shelter/stored-stories-page.png"
        ],
        "url": "https://github.com/team-Beverly-Hills/word-game-app",
        "technologies": [
          {
            "name": "HTML 5",
            "class": "devicon-html5-plain",
            "level": "95"
          },
          {
            "name": "CSS 3",
            "class": "devicon-css3-plain",
            "level": "95"
          },
          
          {
            "name": "JavaScript",
            "class": "devicon-javascript-plain",
            "level": "70"
          }
        ]
      },
      {
        "title": "Where In The World",
        "startDate": "2022",
        "description": "I developed a dynamic webpage that integrated a third-party API to facilitate the search and presentation of places of interest. The site enabled users to save locations, and through integration with MongoDB, their selections were securely and persistently stored. Additionally, I implemented Auth0 to ensure that user authentication was both simple and secure. By parsing data in the backend, I was able to ensure that the data presented to users was accurate and easy to comprehend.",
        "images": [
          "images/portfolio/adventure/Landing_page(signedIN).webp",
          "images/portfolio/adventure/About_page.webp"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "name": "HTML 5",
            "class": "devicon-html5-plain",
            "level": "95"
          },
          {
            "name": "CSS 3",
            "class": "devicon-css3-plain",
            "level": "95"
          },
          
          {
            "name": "JavaScript",
            "class": "devicon-javascript-plain",
            "level": "70"
          }
        ]
      },
      {
        "title": "RAPCON",
        "startDate": "2022",
        "description": "Developed a backend application that reports real-time flight status to the users, leveraging the Airlabs API. To enable fast data transfer between servers, the application utilized the socket.io framework and integrated with Twilio to deliver flight updates at regular intervals. The application architecture was designed with a scalable and modular approach, allowing for seamless migration to AWS in the future. The development process followed a Test Driven Development (TDD) approach, and comprehensive unit tests were created to ensure the application's reliability and functionality.",
        "images": [
          "images/portfolio/photography/rapcon(flight tracker).webp",
          "images/portfolio/photography/rapcon(paylod).jpg",
          "images/portfolio/photography/twilio.webp"
        ],
        "url": "https://github.com/RAPCONs/RAPCON",
        "technologies": [
          {
            "name": "Node",
            "class": "devicon-nodejs-plain",
            "level": "95"
          },
          {
            "name": "JavaScript",
            "class": "devicon-javascript-plain",
            "level": "70"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Valley Medical Center",
        "title": "Freelance Software Developer/Data Analyst",
        "years": "Sept-2022 - Present",
        "mainTech": [
          "PowerQuery"
        ],
        "technologies": [
          "Excel",
          "Sharpoint",
          "Pivot-Tables",
          "Python"
        ]
      },
      {
        "company": "Allied Universal",
        "title": "Security-Guard",
        "years": "Nov-2022 - Present",
        "mainTech": [
          "F5 Building"
        ],
        "technologies": [
        
        ]
      },
      {
        "company": "Searchegg.io",
        "title": "Software Engineer",
        "years": "May-2022 - Present",
        "mainTech": [
          "TypeScript"
        ],
        "technologies": [
          "TypeScript",
          "React",
          "JavaScript",
          "Node.js"
        ]
      },
      {
        "company": "Code-Fellows",
        "title": "Full Stack Developer",
        "years": "Feb-2022 - Aug-2022",
        "mainTech": [
          "JavaScript"
        ],
        "technologies": [
          "React",
          "JavaScript",
          "Bootstrap",
          "HTML",
          "CSS"
        ]
      },
      {
        "company": "Allied Universal",
        "title": "Security-Guard",
        "years": "Jan-2018 - Present",
        "mainTech": [
          "Lynden"
        ],
        "technologies": [
        
        ]
      }
    ]
  }
